{"data":{"allMarkdownRemark":{"edges":[{"node":{"fields":{"slug":"/robot-attack-adventures-in-google-analytics"},"frontmatter":{"title":"Robot Attack: Adventures in Google Analytics","date":"30 September, 2014"},"excerpt":"It's been a while since I've posted. I'm not sure if anyone even reads my posts anyway... If only there were a way to see if anyone reads them... Which reminds me...\n\nOnce upon a time, I set up Google Analytics on a couple websites. The immediate results were actually really neat. I could see that people were visiting the sites.\n\n"}},{"node":{"fields":{"slug":"/exploring-a-switch-statement-alternative"},"frontmatter":{"title":"Exploring a Switch Statement Alternative","date":"18 July, 2014"},"excerpt":"I ran across this [article](http://www.codeproject.com/Tips/798140/Switch-statement-alternative) on an alternative to switch statements. Basically it was using a look-up table rather than a switch statement.\n\n"}},{"node":{"fields":{"slug":"/resolving-tcp-error-in-octopress-preview"},"frontmatter":{"title":"Resolving TCP Error in Octopress Preview","date":"18 June, 2014"},"excerpt":"Not all error messages are very helpful. Usually, the less descriptive an error message is, the longer it takes to track down the issue.\n\nIn my case, it concerned this blog itself. I was having an error while attempting to preview my site with `rake preview`.\n\n"}},{"node":{"fields":{"slug":"/regex-tip-dont-capture-groups"},"frontmatter":{"title":"Regex Tip - Don't Capture Groups","date":"10 June, 2014"},"excerpt":"Regular expressions can be super useful, but they can also be a bit of a pain to work with sometimes. Yesterday I learned about something pretty handy -- a way to tell the regular expression to not capture a group. I've been dealing with captured groups that I do not need captured for years now. Finally, I found an way to remove that nuisance.\n\n"}},{"node":{"fields":{"slug":"/coming-soon"},"frontmatter":{"title":"Coming Soon","date":"05 June, 2014"},"excerpt":"\nComing soon to a browser near you!\n\n"}}]}},"pageContext":{}}