{"data":{"markdownRemark":{"html":"<p>It's been a while since I've posted. I'm not sure if anyone even reads my posts anyway... If only there were a way to see if anyone reads them... Which reminds me...</p>\n<p>Once upon a time, I set up Google Analytics on a couple websites. The immediate results were actually really neat. I could see that people were visiting the sites.</p>\n<!-- more -->\n<p>Well, it was all really neat until I really dug into the details. Then I noticed something that I thought was odd. Most of the hits were from Brazil; in fact, nearly 50% of the hits were from Brazil. ON BOTH SITES. Two independent sites. Both with similar results. Why are there so many views from Brazil. One of the sites is for an application I have that is for retiring United States Military service members. Why would someone in Brazil care about that?</p>\n<p>I overheard <a href=\"http://joshuarogers.net\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Josh Rogers</a>, who first showed me Google Analytics, mention his own analytics page and bot filtering. I mentioned my site views from Brazil, and he mentioned having similar views from Brazil. If you are truly an astute observer, you might have guessed that either nothing I found by searching Google seemed like an obvious answer OR I didn't look through the search results well enough. Honestly, It was probably the latter one, but I hope you didn't guess that one :)</p>\n<p>I then searched far and wide inside the deep forest of Google Analytics. Then I found a checkbox for \"Bot Filtering\".</p>\n<p>First, go to the Admin section at the top. Then, click on the \"View Settings\" in the rightmost column.</p>\n<p><a href=\"/assets/2014-09-30-ga-view-settings.png\"><img src=\"/assets/2014-09-30-ga-view-settings.png\" alt=\"Google Analytics - Admin Settings\"></a></p>\n<p>There will be an option for \"Exclude all hits from known bots and spiders\".</p>\n<p><a href=\"/assets/2014-09-30-ga-bot-filtering.png\"><img src=\"/assets/2014-09-30-ga-bot-filtering.png\" alt=\"Google Analytics - Admin filtering\"></a></p>\n<p>There you have it! Bot filtering is now enabled on your Google Analytics enabled site!<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup></p>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p>I haven't had the setting turned on for long enough to determine how effective it is (I just enabled it earlier today).</p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>","excerpt":"It's been a while since I've posted. I'm not sure if anyone even reads my posts anyway... If only there were a way to see if anyone reads them... Which reminds me...\n\nOnce upon a time, I set up Google Analytics on a couple websites. The immediate results were actually really neat. I could see that people were visiting the sites.\n\n","frontmatter":{"title":"Robot Attack: Adventures in Google Analytics","date":"30.09.2014"}}},"pageContext":{"slug":"/blogs/2014-09-30-robot-attack-adventures-in-google-analytics/"}}